import sys
input = sys.stdin.readline

T = int(input())

for _ in range(T):
    n = int(input())
    dp = [list(map(int, input().split())) for _ in range(2)]

    # 상하좌우 없어짐... 두 변을 공유하지 않는... 대각선은 가능?
    # 제일 큰 놈부터... 자기가 상하좌우 합보다 크거나 같으면 살린다?
    # 대각선 지그재그... 다음 대각선, 다다음 대각선 중 큰 거로 간다
    # 이동 경로 점수 다 합치면 정답

    if n > 1:
        dp[0][1] += dp[1][0]
        dp[1][1] += dp[0][0]
        # 시작 따로, 위 1번째에 아래 0번째, 아래 1번째에 위 0번째 더함

        for i in range(2, n):
            dp[0][i] += max(dp[1][i - 1], dp[1][i - 2])
            dp[1][i] += max(dp[0][i - 1], dp[0][i - 2])

            # 위/아래 i번째에 전 왼쪽 대각선 더하냐 전전 대각선 더하냐?
            # 50, 50, 100, 60에서... 100에 50 더하냐 30 더하냐? 60에 20 더하냐 100 더하냐?

    print(max(dp[0][n-1], dp[1][n-1])) # 위아래, 아래위 중 뭐가 더 큰지

